<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"8666ea3c6a8203347fffdc40fbe59460a4768e0420e5e13f031310506d979780","plan_job_ref":"Job Infrastructure #219 at https://github.com/coverage-robot/core/actions/runs/6422105708","plan_hash":"f65adf18f68d705a2b8a638e63121d92122103975dcf320a062bcf8809dbe919","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.warehouse.google_storage_bucket.loadable_data_bucket will be created
  + resource "google_storage_bucket" "loadable_data_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "coverage-loadable-data-prod"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 1
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ line_coverage_table       = {
      ~ etag                        = "djSE5T6JvoUsHFW1oXW/mA==" -> "w7Ue7uNT+mlLcQKZdIlVuQ=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
      ~ last_modified_time          = 1696126643782 -> 1696522648872
      ~ num_bytes                   = 265214132 -> 3170511769
      ~ num_rows                    = 683215 -> 8063487
        # (23 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #219](https://github.com/coverage-robot/core/actions/runs/6422105708)